app/views/carts/index.html.erb

<h3>Order Total</h3>
<h4><%= "$#{@carts.to_a.map{|item| item.product.price_in_cents}.sum}.00" %></h4>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 61], ["LIMIT", 1]]