app/controllers/carts_controller.rb

  def create
    c = current_user.carts.build
    c.product_id = params[:product_id]
    c.save!
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at", "product_id") VALUES (?, ?, ?, ?)  [["user_id", 2], ["created_at", "2018-02-11 18:07:54.170632"], ["updated_at", "2018-02-11 18:07:54.170632"], ["product_id", 61]]

  def product_delete
    @carts = current_user.carts
    p = @carts.where(id: params[:id], product_id: params[:product_id])
    p.first.destroy
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."cart_id" = ? AND "carts"."product_id" = ? ORDER BY "carts"."id" ASC LIMIT ?  [["user_id", 2], ["cart_id", "6"], ["product_id", 65], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 6]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 62]]